app/controllers/datos_controller.rb

SELECT "datos".* FROM "datos"
---
  def index
    @datos = Dato.all

INSERT INTO "datos" ("name", "email", "totalIngress", "sector", "workYears", "amount", "frecuency", "payTime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  @dato = Dato.new(dato_params)
  respond_to do |format|
    if @dato.amount > 100 and @dato.amount < 2000
      if @dato.save

UPDATE "datos" SET "sector" = ?, "updated_at" = ? WHERE "datos"."id" = ?  [["sector", "Público"], ["updated_at", "2020-12-03 07:07:03.435654"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @dato.update(dato_params)

DELETE FROM "datos" WHERE "datos"."id" = ?  [["id", 3]]
---
  def destroy
    @dato.destroy

SELECT  "datos".* FROM "datos" WHERE "datos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_dato
      @dato = Dato.find(params[:id])